
## Plan Result (prod)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 2 to destroy.</code></pre>

* Update
  * module.pcq-db-flexible.azurerm_postgresql_flexible_server.pgsql_server
* Replace
  * module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_name
  * module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_password


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.pcq-db-flexible.azurerm_postgresql_flexible_server.pgsql_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
        id                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-backend-flexible-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/pcq-backend-flexible-prod"
        name                          = "pcq-backend-flexible-prod"
      ~ public_network_access_enabled = false -> true
        tags                          = {
            "application"         = "protected-characteristics-questionnaire"
            "builtFrom"           = "https://github.com/HMCTS/pcq-backend.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#pcq-dev"
            "environment"         = "production"
            "managedBy"           = "PCQ"
        }
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sdp_db_user[0].data.azurerm_key_vault.sdp_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "sdp_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "mi-vault-prod"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "mi-prod-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.sdp_db_user[0].data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_name must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_name" {
      ~ id                      = "https://mi-vault-prod.vault.azure.net/secrets/pcq-backend-flexible-prod-read-user-name/30ea337b97694c9491a5fc2830e68ab4" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod" # forces replacement -> (known after apply) # forces replacement
        name                    = "pcq-backend-flexible-prod-read-user-name"
      ~ resource_id             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/pcq-backend-flexible-prod-read-user-name/versions/30ea337b97694c9491a5fc2830e68ab4" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/pcq-backend-flexible-prod-read-user-name" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "30ea337b97694c9491a5fc2830e68ab4" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-prod.vault.azure.net/secrets/pcq-backend-flexible-prod-read-user-name" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_password must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_password" {
      ~ id                      = "https://mi-vault-prod.vault.azure.net/secrets/pcq-backend-flexible-prod-read-user-password/4122caa4ff5c4631a9777929676dc692" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod" # forces replacement -> (known after apply) # forces replacement
        name                    = "pcq-backend-flexible-prod-read-user-password"
      ~ resource_id             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/pcq-backend-flexible-prod-read-user-password/versions/4122caa4ff5c4631a9777929676dc692" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/pcq-backend-flexible-prod-read-user-password" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "4122caa4ff5c4631a9777929676dc692" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-prod.vault.azure.net/secrets/pcq-backend-flexible-prod-read-user-password" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1041,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->